test/wrk2/media_microservice/output_compose-review-async_100.log
Running 15m test @ http://130.127.133.219:30081
  1 threads and 5 connections
  Thread calibration: mean lat.: 3488.077ms, rate sampling interval: 13934ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.26m     3.55m   12.44m    57.61%
    Req/Sec    16.60      0.58    18.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.22m 
 75.000%    9.34m 
 90.000%   11.18m 
 99.000%   12.31m 
 99.900%   12.43m 
 99.990%   12.44m 
 99.999%   12.45m 
100.000%   12.45m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8114.175     0.000000            1         1.00
   79888.383     0.100000         1520         1.11
  155058.175     0.200000         3040         1.25
  228589.567     0.300000         4560         1.43
  301203.455     0.400000         6082         1.67
  373293.055     0.500000         7602         2.00
  409993.215     0.550000         8362         2.22
  446955.519     0.600000         9123         2.50
  484442.111     0.650000         9879         2.86
  522715.135     0.700000        10643         3.33
  560463.871     0.750000        11399         4.00
  579862.527     0.775000        11779         4.44
  598212.607     0.800000        12163         5.00
  617086.975     0.825000        12549         5.71
  634912.767     0.850000        12926         6.67
  652738.559     0.875000        13300         8.00
  662175.743     0.887500        13497         8.89
  671088.639     0.900000        13688        10.00
  680001.535     0.912500        13877        11.43
  689438.719     0.925000        14063        13.33
  698875.903     0.937500        14257        16.00
  703070.207     0.943750        14345        17.78
  707788.799     0.950000        14442        20.00
  713031.679     0.956250        14541        22.86
  717225.983     0.962500        14631        26.67
  722468.863     0.968750        14727        32.00
  725090.303     0.971875        14776        35.56
  727187.455     0.975000        14822        40.00
  729808.895     0.978125        14867        45.71
  731906.047     0.981250        14914        53.33
  734527.487     0.984375        14972        64.00
  735576.063     0.985938        14993        71.11
  736624.639     0.987500        15008        80.00
  738197.503     0.989062        15040        91.43
  739246.079     0.990625        15062       106.67
  740294.655     0.992188        15081       128.00
  740818.943     0.992969        15093       142.22
  741343.231     0.993750        15105       160.00
  741867.519     0.994531        15116       182.86
  742391.807     0.995313        15126       213.33
  742916.095     0.996094        15140       256.00
  743440.383     0.996484        15150       284.44
  743440.383     0.996875        15150       320.00
  743964.671     0.997266        15161       365.71
  744488.959     0.997656        15170       426.67
  744488.959     0.998047        15170       512.00
  745013.247     0.998242        15178       568.89
  745013.247     0.998437        15178       640.00
  745013.247     0.998633        15178       731.43
  745537.535     0.998828        15186       853.33
  745537.535     0.999023        15186      1024.00
  745537.535     0.999121        15186      1137.78
  745537.535     0.999219        15186      1280.00
  746061.823     0.999316        15193      1462.86
  746061.823     0.999414        15193      1706.67
  746061.823     0.999512        15193      2048.00
  746061.823     0.999561        15193      2275.56
  746061.823     0.999609        15193      2560.00
  746061.823     0.999658        15193      2925.71
  746061.823     0.999707        15193      3413.33
  746586.111     0.999756        15196      4096.00
  746586.111     0.999780        15196      4551.11
  746586.111     0.999805        15196      5120.00
  746586.111     0.999829        15196      5851.43
  746586.111     0.999854        15196      6826.67
  746586.111     0.999878        15196      8192.00
  746586.111     0.999890        15196      9102.22
  746586.111     0.999902        15196     10240.00
  746586.111     0.999915        15196     11702.86
  746586.111     0.999927        15196     13653.33
  747110.399     0.999939        15197     16384.00
  747110.399     1.000000        15197          inf
#[Mean    =   375328.658, StdDeviation   =   212884.268]
#[Max     =   746586.112, Total count    =        15197]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  291.33ms
 75.000%  312.32ms
 90.000%  400.64ms
 99.000%  540.16ms
 99.900%  643.07ms
 99.990%  721.41ms
 99.999%  725.50ms
100.000%  725.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      87.807     0.000000            1         1.00
     199.423     0.100000         1521         1.11
     211.071     0.200000         3049         1.25
     229.119     0.300000         4562         1.43
     281.599     0.400000         6091         1.67
     291.327     0.500000         7630         2.00
     294.911     0.550000         8364         2.22
     297.727     0.600000         9142         2.50
     300.543     0.650000         9902         2.86
     304.639     0.700000        10674         3.33
     312.319     0.750000        11411         4.00
     319.487     0.775000        11778         4.44
     339.711     0.800000        12160         5.00
     379.391     0.825000        12538         5.71
     392.703     0.850000        12930         6.67
     397.311     0.875000        13309         8.00
     399.103     0.887500        13495         8.89
     400.639     0.900000        13687        10.00
     403.711     0.912500        13868        11.43
     411.135     0.925000        14060        13.33
     431.359     0.937500        14249        16.00
     439.039     0.943750        14345        17.78
     445.695     0.950000        14439        20.00
     451.839     0.956250        14533        22.86
     485.631     0.962500        14628        26.67
     494.847     0.968750        14723        32.00
     497.407     0.971875        14773        35.56
     499.455     0.975000        14820        40.00
     503.807     0.978125        14866        45.71
     515.071     0.981250        14913        53.33
     527.359     0.984375        14960        64.00
     530.431     0.985938        14986        71.11
     534.527     0.987500        15014        80.00
     538.111     0.989062        15032        91.43
     541.183     0.990625        15055       106.67
     545.791     0.992188        15083       128.00
     547.327     0.992969        15091       142.22
     550.399     0.993750        15103       160.00
     554.495     0.994531        15114       182.86
     587.775     0.995313        15126       213.33
     599.039     0.996094        15139       256.00
     601.087     0.996484        15145       284.44
     625.663     0.996875        15151       320.00
     628.223     0.997266        15156       365.71
     630.783     0.997656        15162       426.67
     634.879     0.998047        15168       512.00
     637.951     0.998242        15171       568.89
     640.511     0.998437        15174       640.00
     641.023     0.998633        15177       731.43
     642.047     0.998828        15180       853.33
     643.071     0.999023        15184      1024.00
     643.071     0.999121        15184      1137.78
     644.095     0.999219        15186      1280.00
     645.631     0.999316        15187      1462.86
     646.655     0.999414        15189      1706.67
     649.727     0.999512        15190      2048.00
     650.239     0.999561        15191      2275.56
     652.287     0.999609        15192      2560.00
     652.287     0.999658        15192      2925.71
     693.759     0.999707        15193      3413.33
     697.343     0.999756        15194      4096.00
     697.343     0.999780        15194      4551.11
     721.407     0.999805        15195      5120.00
     721.407     0.999829        15195      5851.43
     721.407     0.999854        15195      6826.67
     723.455     0.999878        15196      8192.00
     723.455     0.999890        15196      9102.22
     723.455     0.999902        15196     10240.00
     723.455     0.999915        15196     11702.86
     723.455     0.999927        15196     13653.33
     725.503     0.999939        15197     16384.00
     725.503     1.000000        15197          inf
#[Mean    =      291.197, StdDeviation   =       83.677]
#[Max     =      724.992, Total count    =        15197]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15393 requests in 15.00m, 3.86MB read
Requests/sec:     17.10
Transfer/sec:      4.39KB